app/views/teams/show.html.erb

  <tbody>
    <% @team.gladiators.where(death: nil).each do |gladiator| %>
---
SELECT "gladiators".* FROM "gladiators" WHERE "gladiators"."team_id" = ? AND ("gladiators"."death" IS NOT NULL)  [["team_id", 1]]

  <tbody>
    <% @team.gladiators.where.not(death: nil).each do |gladiator| %>
---
SELECT "gladiators".* FROM "gladiators" WHERE "gladiators"."team_id" = ?  [["team_id", 1]]