app/views/events/show.html.erb

  <tbody>
    <% @event.fights.sort_by(&:sequence).each do |fight| %>
---
SELECT "fights".* FROM "fights" WHERE "fights"."event_id" = ?  [["event_id", 1]]

      <td><%= link_to fight.id, event_fight_path(@event,fight)%></td>
      <td><% fight.fight_items.each do |fighter| %>
---
SELECT "fight_items".* FROM "fight_items" WHERE "fight_items"."fight_id" = ?  [["fight_id", 82]]