app/controllers/events_controller.rb

INSERT INTO "events" ("name", "scheduledDate", "runDate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Fight Night"], ["scheduledDate", 2016-11-28 17:40:00 UTC], ["runDate", 2016-11-27 17:40:00 UTC], ["created_at", 2016-11-27 17:41:05 UTC], ["updated_at", 2016-11-27 17:41:05 UTC]]
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

SELECT "gladiators".* FROM "gladiators" WHERE "gladiators"."death" IS NULL
SELECT "gladiators".* FROM "gladiators"
INSERT INTO "fights" ("event_id", "sequence", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["event_id", 1], ["sequence", 1], ["created_at", 2016-11-27 19:47:12 UTC], ["updated_at", 2016-11-27 19:47:12 UTC]]
---
  def buildSchedule
    #take all the gladiators and randomly assign them into fights
    #don't make gladiators from the same team fight each other
    #use a reserve team to solve for imblances (not implemented)

    _fightflag = false
    _fighters = Gladiator.where(death: nil).shuffle
    _i = 0
    #using 100 as a cheap limit on finding a fighter could break for large fights
    while _i < 100 and _fighters.count > 0 do
      if not(_fightflag)
        _fight = @event.fights.create(sequence: _i)

SELECT "fights".* FROM "fights" WHERE "fights"."event_id" = ?  [["event_id", 1]]
---
  def run()
    logger.info @event.name + ' has begun!'
    @event.fights.each { |x| x.run }