app/controllers/fights_controller.rb

  def run
    $loglevel = 4
    @log=""
    @fighters = @fight.fight_items
     @log << @fighters.class.to_s+'<br>' if $loglevel >= 5
	@fighters.each { |x| x.setupFight}
---
SELECT "fight_items".* FROM "fight_items" WHERE "fight_items"."fight_id" = ?  [["fight_id", 14]]

    end

    #dole out wounds
    @fighters.each { |x| x.gladiator.cleanup
---
SELECT "gladiators".* FROM "gladiators" INNER JOIN "fight_items" ON "gladiators"."id" = "fight_items"."gladiator_id" WHERE "fight_items"."fight_id" = ?  [["fight_id", 37]]


    logger.info(@log)
	@fight.log = @log
    @fight.save
---
UPDATE "fights" SET "winner" = ?, "updated_at" = ? WHERE "fights"."id" = ?  [["winner", "Fred"], ["updated_at", 2016-11-28 16:45:27 UTC], ["id", 37]]

  def set_fight
  	@fight = Fight.find(params[:id])
---
SELECT  "fights".* FROM "fights" WHERE "fights"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]