app/controllers/gladiators_controller.rb

  def index
    @gladiators = @team.gladiators.all
---
SELECT "gladiators".* FROM "gladiators" WHERE "gladiators"."team_id" = ?  [["team_id", 1]]

  def create
    @gladiator = @team.gladiators.build(gladiator_params)

    respond_to do |format|
      if @gladiator.save
---
INSERT INTO "gladiators" ("team_id", "name", "fightStyle", "str", "dex", "spd", "con", "chr", "intl", "birth", "firstfight", "death", "wounds", "reputation", "created_at", "updated_at", "hp", "hitmod", "strmod") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @gladiator.update(gladiator_params)
---
UPDATE "gladiators" SET "name" = ?, "firstfight" = ?, "death" = ?, "updated_at" = ? WHERE "gladiators"."id" = ?  [["name", "Recuit 1"], ["firstfight", Fri, 23 Dec 2016], ["death", Fri, 23 Dec 2016], ["updated_at", 2016-12-23 14:20:32 UTC], ["id", 17]]

  def destroy
    @gladiator.destroy
---
DELETE FROM "gladiators" WHERE "gladiators"."id" = ?  [["id", 10]]

    def set_gladiator
      @gladiator = @team.gladiators.find(params[:id])
---
SELECT  "gladiators".* FROM "gladiators" WHERE "gladiators"."team_id" = ? AND "gladiators"."id" = ? LIMIT ?  [["team_id", 1], ["id", 11], ["LIMIT", 1]]

    def set_team
      @team = Team.find(params[:team_id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]