app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
---
  def index
    @teams = Team.where(active: true)
    @teams.each {|x| x.updateReputation}

INSERT INTO "teams" ("name", "accountbalance", "reputation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Untouchable"], ["accountbalance", 1000], ["reputation", 0], ["created_at", 2016-11-26 20:34:20 UTC], ["updated_at", 2016-11-26 20:34:20 UTC]]
---
  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save