app/views/fights/show.html.erb

SELECT "gladiators".* FROM "gladiators" INNER JOIN "fight_items" ON "gladiators"."id" = "fight_items"."gladiator_id" WHERE "fight_items"."fight_id" = ?  [["fight_id", 1]]
---
  <tbody>
    <% @fight.gladiators.each do |gladiator| %>