app/views/fights/show.html.erb

  <tbody>
    <% @fight.fight_items.each do |fighter| %>
---
SELECT "fight_items".* FROM "fight_items" WHERE "fight_items"."fight_id" = ?  [["fight_id", 25]]